Обработки/Reports/_РасчетВознагражденияУК_ФОГФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетВознагражденияУК_ФОГФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьРасчетаВознагражденияУправляющего</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетВознагражденияУК_ФОГФ/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантОчистка(Элемент, СтандартнаяОбработка)
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Результат.ИспользуемоеИмяФайла = "Расчет вознаграждения УК ФОГФ с " + Формат(Отчет.Период.ДатаНачала, "ДЛФ=DD") + Формат(Отчет.Период.ДатаОкончания, "ДЛФ=DD") + ".xls";
	Структура = Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант);
	Подписант = РаботаСОтчетами.ПолучитьКонтактноеЛицо(Структура);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	                             	
	Если СтруктураДанныхКонтактногоЛица = Неопределено Тогда 
		Подписант = Неопределено;		
	ИначеЕсли СтруктураДанныхКонтактногоЛица.Объект <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.Организация, "ЮрФизЛицо") ИЛИ СтруктураДанныхКонтактногоЛица.КонтактноеЛицо <> Подписант Тогда
		// Если сохранен подписант другой организации, очистим подписанта
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
		Подписант = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьПараметрыВыбораПериодичностиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	ЗаполнитьПараметрыВыбораПериодичностиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыВыбораПериодичностиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Отчет.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидВознаграждения", Перечисления.ВидыВознагражденийУправляющего.ВознаграждениеУправляющего);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НастройкиРасчетаСоставляющие.Периодичность КАК Периодичность
		|ИЗ
		|	РегистрСведений.НастройкиРасчетаВознагражденияУправляющего.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидВознаграждения = &ВидВознаграждения) КАК НастройкиРасчетаВознагражденияУправляющегоСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчета.Составляющие КАК НастройкиРасчетаСоставляющие
		|		ПО НастройкиРасчетаВознагражденияУправляющегоСрезПоследних.НастройкаРасчета = НастройкиРасчетаСоставляющие.Ссылка";
	
	МассивПериодичность = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивПериодичность));
	
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(ПараметрВыбора);
	
	Элементы.ПериодичностьРасчета.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
	Если МассивПериодичность.Количество() = 1 Тогда
		Отчет.ПериодичностьРасчета = МассивПериодичность[0];
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантГлБухгалтерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, ПодписантГлБухгалтер));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПодписантГлБухгалтерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДополнительныеСвойства = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;		
	
	Если Не ДополнительныеСвойства.Свойство("СтруктураДанныхГлБухгалтера") Тогда
		ДополнительныеСвойства.Вставить("СтруктураДанныхГлБухгалтера");	
	КонецЕсли;	
	
	РаботаСОтчетамиКлиент.ПодписантОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ДополнительныеСвойства.СтруктураДанныхГлБухгалтера, ЭтаФорма.Отчет.Организация);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры
